In [19]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [20]:
%sql sqlite:///string_function.db

In [21]:
%sql SELECT * FROM books;

 * sqlite:///string_function.db
Done.

[(1, 'The Namesake', 'Jhumpa', 'Lahiri', 2003, 32, 291),
 (2, 'Norse Mythology', 'Neil', 'Gaiman', 2016, 43, 304),
 (3, 'American Gods', 'Neil', 'Gaiman', 2001, 12, 465),
 (4, 'Interpreter of Maladies', 'Jhumpa', 'Lahiri', 1996, 97, 198),
 (5, 'A Hologram for the King: A Novel', 'Dave', 'Eggers', 2012, 154, 352),
 (6, 'The Circle', 'Dave', 'Eggers', 2013, 26, 504),
 (7, 'The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634),
 (8, 'Just Kids', 'Patti', 'Smith', 2010, 55, 304),
 (9, 'A Heartbreaking Work of Staggering Genius', 'Dave', 'Eggers', 2001, 104, 437),
 (10, 'Coraline', 'Neil', 'Gaiman', 2003, 100, 208),
 (11, 'What We Talk About When We Talk About Love: Stories', 'Raymond', 'Carver', 1981, 23, 176),
 (12, "Where I'm Calling From: Selected Stories", 'Raymond', 'Carver', 1989, 12, 526),
 (13, 'White Noise', 'Don', 'DeLillo', 1985, 49, 320),
 (14, 'Cannery Row', 'John', 'Steinbeck', 1945, 95, 181),
 (15, 'Oblivion: Stories', 'David', 'Foster Wallace', 2004, 172, 329),
 (16, 'Consider the Lobster', 'David', 'Foster Wallace', 2005, 92, 343),
 (17, '10% Happier', 'Dan', 'Harris', 2014, 29, 256),
 (18, 'fake_book', 'Freida', 'Harris', 2001, 287, 428),
 (19, 'Lincoln In The Bardo', 'George', 'Saunders', 2017, 1000, 367)]

#### **COUNT** ####

In [22]:
%sql SELECT COUNT(*) FROM books;

 * sqlite:///string_function.db
Done.

[(19,)]

In [23]:
%sql SELECT COUNT(DISTINCT author_fname) FROM books;

 * sqlite:///string_function.db
Done.

[(12,)]

In [24]:
%sql SELECT COUNT(title) fROM books WHERE title LIKE '%the%'

 * sqlite:///string_function.db
Done.

[(6,)]

#### **GROUP BY** ####

In [25]:
%%sql
SELECT COUNT(*) AS Book_number, author_lname FROM books
GROUP BY author_lname ORDER BY Book_number DESC

 * sqlite:///string_function.db
Done.

[(3, 'Gaiman'),
 (3, 'Eggers'),
 (2, 'Lahiri'),
 (2, 'Harris'),
 (2, 'Foster Wallace'),
 (2, 'Carver'),
 (1, 'Steinbeck'),
 (1, 'Smith'),
 (1, 'Saunders'),
 (1, 'DeLillo'),
 (1, 'Chabon')]

In [26]:
%%sql
SELECT released_year, COUNT(*) AS num FROM books GROUP BY released_year ORDER BY num;

 * sqlite:///string_function.db
Done.

[(1945, 1),
 (1981, 1),
 (1985, 1),
 (1989, 1),
 (1996, 1),
 (2000, 1),
 (2004, 1),
 (2005, 1),
 (2010, 1),
 (2012, 1),
 (2013, 1),
 (2014, 1),
 (2016, 1),
 (2017, 1),
 (2003, 2),
 (2001, 3)]

In [27]:
%sql SELECT * FROM books GROUP by author_lname;

 * sqlite:///string_function.db
Done.

[(11, 'What We Talk About When We Talk About Love: Stories', 'Raymond', 'Carver', 1981, 23, 176),
 (7, 'The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634),
 (13, 'White Noise', 'Don', 'DeLillo', 1985, 49, 320),
 (5, 'A Hologram for the King: A Novel', 'Dave', 'Eggers', 2012, 154, 352),
 (15, 'Oblivion: Stories', 'David', 'Foster Wallace', 2004, 172, 329),
 (2, 'Norse Mythology', 'Neil', 'Gaiman', 2016, 43, 304),
 (17, '10% Happier', 'Dan', 'Harris', 2014, 29, 256),
 (1, 'The Namesake', 'Jhumpa', 'Lahiri', 2003, 32, 291),
 (19, 'Lincoln In The Bardo', 'George', 'Saunders', 2017, 1000, 367),
 (8, 'Just Kids', 'Patti', 'Smith', 2010, 55, 304),
 (14, 'Cannery Row', 'John', 'Steinbeck', 1945, 95, 181)]

#### **MIN-MAX** ####

In [28]:
%sql SELECT MIN(pages), title FROM Books;

 * sqlite:///string_function.db
Done.

[(176, 'What We Talk About When We Talk About Love: Stories')]

In [29]:
%sql SELECT MAX(pages), title FROM Books;

 * sqlite:///string_function.db
Done.

[(634, 'The Amazing Adventures of Kavalier & Clay')]

#### **SUBQUERIES** ####

In [30]:
%sql SELECT title, pages FROM books ORDER BY pages DESC LIMIT 1;

 * sqlite:///string_function.db
Done.

[('The Amazing Adventures of Kavalier & Clay', 634)]

In [31]:
%%sql
SELECT * FROM books
WHERE pages = (SELECT MAX(pages) FROM books);

 * sqlite:///string_function.db
Done.

[(7, 'The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634)]

In [32]:
%%sql
SELECT title, released_year FROM books 
WHERE released_year = (SELECT MIN(released_year) FROM books);

 * sqlite:///string_function.db
Done.

[('Cannery Row', 1945)]

#### **GROUP SEVERAL COLUMS** ####

In [33]:
%sql SELECT author_lname, author_fname, COUNT(*) FROM books GROUP BY author_lname, author_fname;

 * sqlite:///string_function.db
Done.

[('Carver', 'Raymond', 2),
 ('Chabon', 'Michael', 1),
 ('DeLillo', 'Don', 1),
 ('Eggers', 'Dave', 3),
 ('Foster Wallace', 'David', 2),
 ('Gaiman', 'Neil', 3),
 ('Harris', 'Dan', 1),
 ('Harris', 'Freida', 1),
 ('Lahiri', 'Jhumpa', 2),
 ('Saunders', 'George', 1),
 ('Smith', 'Patti', 1),
 ('Steinbeck', 'John', 1)]

In [34]:
%%sql
SELECT CONCAT(Author_fname, ' ', author_lname) AS author, COUNT(*)
FROM books
GROUP BY author;

 * sqlite:///string_function.db
Done.

[('Dan Harris', 1),
 ('Dave Eggers', 3),
 ('David Foster Wallace', 2),
 ('Don DeLillo', 1),
 ('Freida Harris', 1),
 ('George Saunders', 1),
 ('Jhumpa Lahiri', 2),
 ('John Steinbeck', 1),
 ('Michael Chabon', 1),
 ('Neil Gaiman', 3),
 ('Patti Smith', 1),
 ('Raymond Carver', 2)]

#### **MIN / MAX / GROUPING** ####

In [35]:
%%sql
SELECT author_lname, MIN(released_year) FROM books GROUP BY author_lname;

 * sqlite:///string_function.db
Done.

[('Carver', 1981),
 ('Chabon', 2000),
 ('DeLillo', 1985),
 ('Eggers', 2001),
 ('Foster Wallace', 2004),
 ('Gaiman', 2001),
 ('Harris', 2001),
 ('Lahiri', 1996),
 ('Saunders', 2017),
 ('Smith', 2010),
 ('Steinbeck', 1945)]

In [36]:
%%sql
SELECT CONCAT(author_lname,' ', author_fname), COUNT(*), MIN(released_year), MAX(released_year) , MAX(pages) FROM books GROUP BY author_lname, author_fname ORDER BY author_lname desc;

 * sqlite:///string_function.db
Done.

[('Steinbeck John', 1, 1945, 1945, 181),
 ('Smith Patti', 1, 2010, 2010, 304),
 ('Saunders George', 1, 2017, 2017, 367),
 ('Lahiri Jhumpa', 2, 1996, 2003, 291),
 ('Harris Dan', 1, 2014, 2014, 256),
 ('Harris Freida', 1, 2001, 2001, 428),
 ('Gaiman Neil', 3, 2001, 2016, 465),
 ('Foster Wallace David', 2, 2004, 2005, 343),
 ('Eggers Dave', 3, 2001, 2013, 504),
 ('DeLillo Don', 1, 1985, 1985, 320),
 ('Chabon Michael', 1, 2000, 2000, 634),
 ('Carver Raymond', 2, 1981, 1989, 526)]

#### **SUM** ####

In [43]:
%%sql
SELECT author_lname, author_fname, SUM(pages) AS Total_pages 
FROM books
GROUP BY author_lname, author_fname
ORDER BY Total_pages DESC;

 * sqlite:///string_function.db
Done.

[('Eggers', 'Dave', 1293),
 ('Gaiman', 'Neil', 977),
 ('Carver', 'Raymond', 702),
 ('Foster Wallace', 'David', 672),
 ('Chabon', 'Michael', 634),
 ('Lahiri', 'Jhumpa', 489),
 ('Harris', 'Freida', 428),
 ('Saunders', 'George', 367),
 ('DeLillo', 'Don', 320),
 ('Smith', 'Patti', 304),
 ('Harris', 'Dan', 256),
 ('Steinbeck', 'John', 181)]

In [44]:
%%sql
SELECT author_lname, COUNT(*) AS Book_count, SUM(pages) AS Total_pages
FROM books
GROUP BY author_lname;

 * sqlite:///string_function.db
Done.

[('Carver', 2, 702),
 ('Chabon', 1, 634),
 ('DeLillo', 1, 320),
 ('Eggers', 3, 1293),
 ('Foster Wallace', 2, 672),
 ('Gaiman', 3, 977),
 ('Harris', 2, 684),
 ('Lahiri', 2, 489),
 ('Saunders', 1, 367),
 ('Smith', 1, 304),
 ('Steinbeck', 1, 181)]

#### **AVERAGE** ####

In [49]:
%%sql
SELECT author_lname, COUNT(*) AS Book_count, AVG(pages) AS Average_pages
FROM books
GROUP BY author_lname;

 * sqlite:///string_function.db
Done.

[('Carver', 2, 351.0),
 ('Chabon', 1, 634.0),
 ('DeLillo', 1, 320.0),
 ('Eggers', 3, 431.0),
 ('Foster Wallace', 2, 336.0),
 ('Gaiman', 3, 325.6666666666667),
 ('Harris', 2, 342.0),
 ('Lahiri', 2, 244.5),
 ('Saunders', 1, 367.0),
 ('Smith', 1, 304.0),
 ('Steinbeck', 1, 181.0)]

In [50]:
%%sql
SELECT 
    released_year, 
    AVG(stock_quantity), 
    COUNT(*) FROM books
GROUP BY released_year;

 * sqlite:///string_function.db
Done.

[(1945, 95.0, 1),
 (1981, 23.0, 1),
 (1985, 49.0, 1),
 (1989, 12.0, 1),
 (1996, 97.0, 1),
 (2000, 68.0, 1),
 (2001, 134.33333333333334, 3),
 (2003, 66.0, 2),
 (2004, 172.0, 1),
 (2005, 92.0, 1),
 (2010, 55.0, 1),
 (2012, 154.0, 1),
 (2013, 26.0, 1),
 (2014, 29.0, 1),
 (2016, 43.0, 1),
 (2017, 1000.0, 1)]